work/WinVent/Kastenfenster/V05/0.orig/CO2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/initialisationConditions"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $!internalField/CO2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    atmosphere
    {
        type  inletOutlet;
        inletValue uniform $!atmosphere/CO2;
        inlet	    	uniform $!atmosphere/CO2;
    }

    staticWalls
    {
        type            zeroGradient;
    }
    
    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
