work/WinVent/Kastenfenster/V05/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            pressureInletOutletVelocity;
        inletValue      $internalField;
        value           $internalField;
    }

    outflow
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform (0 0.1389 0);
        //0.2778 m/s to fast
        //

        // value should be 20m³/h through the window
        // Outflow area = 0.02 m2 (1m * 0.02m)
        // velocity = flowrate/area = 20/3600 / 0.02 = 0.2778 m/s

    }

    staticWalls
    {
        type            noSlip;
    }

    "(glass_inside_master|glass_inside_slave|glass_outside_master|glass_outside_slave)"
    {
        type            noSlip;
    }

    /*".*"
    {
        type            zeroGradient;
    }*/
}

// ************************************************************************* //
