work/WinVent/Kastenfenster/V05/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{

    atmosphere_ground
    {
        type        triSurfaceMesh;
        file        "atmosphere_ground.stl";
    }

    atmosphere_outlet
    {
        type        triSurfaceMesh;
        file        "atmosphere_outlet.stl";
    }

    walls
    {
        type        triSurfaceMesh;
        file        "walls.stl";
    }

    /*window
    {
        type        triSurfaceMesh;
        file        "window.stl";
    }*/
    
    glass_outside
    {
        type        triSurfaceMesh;
        file        "glass_outside.stl";
    }
    
    glass_inside
    {
        type        triSurfaceMesh;
        file        "glass_inside.stl";
    }
    
    outflow
    {
        type        triSurfaceMesh;
        file        "outflow.stl";
    }

    indoor_volume
    {
        type searchableBox;
        min (0 0 0);
        max (4 6 3);
    }
    
};

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 4;

    features
    (
        {
            file        "walls.eMesh";
            level       3;
        }
        {
            file        "window.eMesh";
            level       4;
        }
        {
            file        "atmosphere_ground.eMesh";
            level       2;
        }
        {
            file        "atmosphere_outlet.eMesh";
            level       2;
        }
        {
            file        "glass_outside.eMesh";
            level       4;
        }
        {
            file        "glass_inside.eMesh";
            level       4;
        }
        {
            file        "outflow.eMesh";
            level       2;
        }
    );

    refinementSurfaces
    {

        atmosphere_ground
        {
            level       (2 2);
            patchInfo
            {
                type wall;
                inGroups (atmosphere);
            }
        }

        atmosphere_outlet
        {
            level       (2 2);
            patchInfo
            {
                type patch;
                inGroups (atmosphere);
            }
        }
        
        walls
        {
            level       (3 4); 
            patchInfo
            {
                type wall;
                inGroups (staticWalls);
            }
        }

        window
        {
            level       (3 4);
            patchInfo
            {
                type wall;
                inGroups(window);
            }
        }
        
        glass_outside
        {
            level       (5 7);
            faceZone    glass_outside;
            cellZone    glass_outside;
            cellZoneInside inside;
            
            patchInfo
            {
                type            baffle;
                inGroups        (glass);
            }
        }
        
        glass_inside
        {
            level       (5 7);
            faceZone    glass_inside;
            cellZone    glass_inside;
            cellZoneInside inside;
            
            patchInfo
            {
                type            baffle;
                inGroups        (glass);
            }
        }
        
        outflow
        {
            level       (3 4); //
            patchInfo
            {
                type patch;
                inGroups (outflow);
            }
        }
        
    }
    refinementRegions
    {
	    indoor_volume
        {
            mode inside;
            levels ((1 3)); 
        }
    }
    resolveFeatureAngle 30;

    insidePoint (0.5 -0.5 0.1);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 1.0;
    nSolveIter 100;
    nRelaxIter 5;
    nFeatureSnapIter 10;//5;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
    }
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 15;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;

    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    maxConcave 80;
    minVol -1e30;
    minTetQuality -1;
    minTwist 0.01;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance 1e-6;

// ************************************************************************* //
